---
title: SynchronizeWithCentralOptions
classe: Autodesk.Revit.DB.SynchronizeWithCentralOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# SynchronizeWithCentralOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Comment { get; set; }` | `synchronizeWithCentralOptions.Comment` | String |
| `Boolean Compact { get; set; }` | `synchronizeWithCentralOptions.Compact` | Boolean |
| `Boolean IsValidObject { get; }` | `synchronizeWithCentralOptions.IsValidObject` | Boolean |
| `Boolean RelinquishBorrowedElements { get; }` | `synchronizeWithCentralOptions.RelinquishBorrowedElements` | Boolean |
| `Boolean RelinquishFamilyWorksets { get; }` | `synchronizeWithCentralOptions.RelinquishFamilyWorksets` | Boolean |
| `Boolean RelinquishProjectStandardWorksets { get; }` | `synchronizeWithCentralOptions.RelinquishProjectStandardWorksets` | Boolean |
| `Boolean RelinquishUserCreatedWorksets { get; }` | `synchronizeWithCentralOptions.RelinquishUserCreatedWorksets` | Boolean |
| `Boolean RelinquishViewWorksets { get; }` | `synchronizeWithCentralOptions.RelinquishViewWorksets` | Boolean |
| `Boolean SaveLocalAfter { get; set; }` | `synchronizeWithCentralOptions.SaveLocalAfter` | Boolean |
| `Boolean SaveLocalBefore { get; set; }` | `synchronizeWithCentralOptions.SaveLocalBefore` | Boolean |
| `Boolean SaveLocalFile { get; }` | `synchronizeWithCentralOptions.SaveLocalFile` | Boolean |
| `Void Dispose()` | `synchronizeWithCentralOptions.Dispose()` | Void |
| `RelinquishOptions GetRelinquishOptions()` | `synchronizeWithCentralOptions.GetRelinquishOptions()` | RelinquishOptions |
| `Void SetRelinquishOptions(RelinquishOptions)` | `synchronizeWithCentralOptions.SetRelinquishOptions(relinquishOptions)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```